servicemix-osgi/secure-proxy/result-SelectChannelConnector.txt
christian-muellers-macbook-pro:secure-proxy cmueller$ /usr/sbin/httpd2.4/bin/ab -n 5000 -c 20 -p 1K_buyStocks_secure.xml -T text/xml http://localhost:8192/service/SecureProxy
This is ApacheBench, Version 2.3 <$Revision: 1373084 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        Apache-Coyote/1.1
Server Hostname:        localhost
Server Port:            8192

Document Path:          /service/SecureProxy
Document Length:        10908 bytes

Concurrency Level:      20
Time taken for tests:   23.937 seconds
Complete requests:      5000
Failed requests:        0
Write errors:           0
Total transferred:      55890000 bytes
Total body sent:        32295000
HTML transferred:       54540000 bytes
Requests per second:    208.88 [#/sec] (mean)
Time per request:       95.750 [ms] (mean)
Time per request:       4.787 [ms] (mean, across all concurrent requests)
Transfer rate:          2280.12 [Kbytes/sec] received
                        1317.52 kb/s sent
                        3597.64 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.5      0      30
Processing:     8   95 139.0     31    1309
Waiting:        0   93 137.0     31    1309
Total:          8   96 139.0     32    1310

Percentage of the requests served within a certain time (ms)
  50%     32
  66%     46
  75%     77
  80%    150
  90%    311
  95%    425
  98%    537
  99%    571
 100%   1310 (longest request)