servicemix-osgi/secure-proxy/result-SelectChannelConnector.txt
Christian-Muellers-MacBook-Pro:secure-proxy cmueller$ /usr/sbin/httpd2.4/bin/ab -n 5000 -c 20 -p 1K_buyStocks_secure.xml -T text/xml http://localhost:8192/service/SecureProxy
This is ApacheBench, Version 2.3 <$Revision: 1373084 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        Apache-Coyote/1.1
Server Hostname:        localhost
Server Port:            8192

Document Path:          /service/SecureProxy
Document Length:        10815 bytes

Concurrency Level:      20
Time taken for tests:   20.855 seconds
Complete requests:      5000
Failed requests:        0
Write errors:           0
Total transferred:      55425000 bytes
Total body sent:        32275000
HTML transferred:       54075000 bytes
Requests per second:    239.75 [#/sec] (mean)
Time per request:       83.419 [ms] (mean)
Time per request:       4.171 [ms] (mean, across all concurrent requests)
Transfer rate:          2595.37 [Kbytes/sec] received
                        1511.33 kb/s sent
                        4106.70 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.0      0      11
Processing:     7   83  76.5     53     523
Waiting:        3   81  75.7     50     523
Total:          7   83  76.5     53     524

Percentage of the requests served within a certain time (ms)
  50%     53
  66%     99
  75%    128
  80%    148
  90%    194
  95%    234
  98%    286
  99%    325
 100%    524 (longest request)