servicemix-osgi/secure-proxy/result.txt
christian-muellers-macbook-pro:servicemix-osgi cmueller$ ab -n 10000 -c 20 -p 1K_buyStocks_secure.xml -T text/xml http://localhost:8192/service/SecureProxy
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        Apache-Coyote/1.1
Server Hostname:        localhost
Server Port:            8192

Document Path:          /service/SecureProxy
Document Length:        10908 bytes

Concurrency Level:      20
Time taken for tests:   58.784 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Total transferred:      111780000 bytes
Total POSTed:           64590000
HTML transferred:       109080000 bytes
Requests per second:    170.12 [#/sec] (mean)
Time per request:       117.567 [ms] (mean)
Time per request:       5.878 [ms] (mean, across all concurrent requests)
Transfer rate:          1856.98 [Kbytes/sec] received
                        1073.02 kb/s sent
                        2930.00 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   2.2      0     103
Processing:     9  117 139.9     47     959
Waiting:        0  115 138.2     46     959
Total:          9  117 139.9     47     959

Percentage of the requests served within a certain time (ms)
  50%     47
  66%     93
  75%    166
  80%    215
  90%    331
  95%    421
  98%    532
  99%    589
 100%    959 (longest request)